# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv10 object detection model. For Usage examples see https://docs.ultralytics.com/tasks/detect

# YOLOv10s-p2,4 summary: 372 layers, 2,597,040 parameters, 2,597,024 gradients, 31.0 GFLOPs

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov10n.yaml' will call yolov10.yaml with scale 'n'
  # [depth, width, max_channels]
  s: [0.33, 0.50, 1024]

backbone:
# [from, repeats, module, args]
- [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
- [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
- [-1, 3, C2f, [128, True]] # 2
- [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
- [-1, 6, C2f, [256, True]] # 4
- [-1, 1, SCDown, [512, 3, 2]] # 5-P4/16
- [-1, 3, C2fCIB, [512, True, True]] # 6
- [-1, 1, SPPF, [512, 5]] # 7 Note: the second parameter indicates the kernel size; in this case is 5
- [-1, 1, PSA, [512]] # 8

# YOLOv10.0n head
head:
- [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 9
- [[-1, 4], 1, Concat, [1]] # 10 cat backbone P3
- [-1, 3, C2f, [256]] # 11

- [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12
- [[-1, 2], 1, Concat, [1]] # 13 cat backbone P2
- [-1, 3, C2f, [128]] # 14 (P2/4-xsmall)

- [-1, 1, Conv, [128, 3, 2]] # 15
- [[-1, 11], 1, Concat, [1]] # 16 cat head P3
- [-1, 3, C2f, [256]] # 17 (P3/8-small)

- [-1, 1, SCDown, [256, 3, 2]] # 18
- [[-1, 8], 1, Concat, [1]] # 19 cat head P4
- [-1, 3, C2fCIB, [512, True, True]] # 20 (P5/32-large)

- [[14, 17, 20], 1, v10Detect, [nc]] # Detect(P3, P4, P5)
